# Suffix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionEqualityLabelFormatting..::..Suffix Property
DimensionEqualityLabelFormatting Class See Also
---
The suffix to include after the parameter value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public string Suffix { get; set; }
```

Visual Basic
---
```text
Public Property Suffix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace